Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.PART_DEFAULTS_MODEL_NAME Field
 The analysis model name for default analysis properties of a part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string PART_DEFAULTS_MODEL_NAME = "AnalysisPartDefaults"
Public Const PART_DEFAULTS_MODEL_NAME As String = "AnalysisPartDefaults"
Field Value
Type: String
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace